notes/400-Meaning-兴趣/450-Emacs-神之编辑器/EmacsLisp语法表.org
* 语法表
  语法表定义每个字符的语法角色，定义单词、符号和其他语法结构的起始和结束位置。Font Lock模式和其他复杂的移动命令都会用到语法表。
  
** 概述
在语法表中可以查询每个字符的语法分类和其他语法属性。Lisp程序用语法表做文本扫描和光标移动。

* 键盘映射
键盘输入事件和各种命令的绑定记录在称为键盘映射表的数据结构中。每个映射将一个单独的输入事件与一个映射表或者是命令关联。如果一个输入事件与映射表关联，那么这个映射表是用来查询下一个输入事件映射的，如此递归，直到找到与输入事件关联的命令。整个过程被称作“按键查询”。
** 按键序列
按键序列是由一个或者多个输入事件构成的单元。按键序列包括字符键、功能键、鼠标动作以及系统事件。Emacs Lisp中用字符串或者向量表示。除非明确说明，Emacs Lisp函数参数两种形式都可以使用。

在字符串表示的序列中，字符和数字表示的是他们自己，控制符由`"\C-"'子串和`"\M-"'字串打头，例如，`"\C-x"'代表`C-x'。而<TAB>,<RET>,<ESC>和<DEL>事件分别由`"\t"',`"\r"',`"\e"',和`"\d"'代表。代表一个完整的按键序列的字符串是由单个字串的串联。比如：`"\C-xl"'表示的按键序列是`C-x l'。

函数： kdb keyseq-text
函数将KEYSEQ-TEXT（一个字符串常量）转换成按键序列（一个字符串或者向量）。KEYSEQ-TEXT的形式如`C-x C-k <RET>'，功能键要用`<...>'括起来。
n
#+BEGIN_SRC elisp
          (kbd "C-x") => "\C-x"
          (kbd "C-x C-f") => "\C-x\C-f"
          (kbd "C-x 4 C-f") => "\C-x4\C-f"
          (kbd "X") => "X"
          (kbd "RET") => "\^M"
          (kbd "C-c SPC") => "\C-c "
          (kbd "<f1> SPC") => [f1 32]
          (kbd "C-M-<down>") => [C-M-down]
#+END_SRC
** 键盘映射表概论
   键盘映射表是为每个按键序列设置其绑定的按键的数据结构。